Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_jh01_cnano/pic32cm_jh01_cnano_smart_appliance_control/firmware/src/packs/PIC32CM5164JH01048_DFP/component/eic.h
#define EIC_PINSTATE_PINSTATE0_Pos            _UINT32_(0)                                          /* (EIC_PINSTATE) Pin State of EXTINT0 Position */
#define EIC_PINSTATE_PINSTATE0_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE0_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT0 Mask */
#define EIC_PINSTATE_PINSTATE0(value)         (EIC_PINSTATE_PINSTATE0_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE0_Pos)) /* Assigment of value for PINSTATE0 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE1_Pos            _UINT32_(1)                                          /* (EIC_PINSTATE) Pin State of EXTINT1 Position */
#define EIC_PINSTATE_PINSTATE1_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE1_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT1 Mask */
#define EIC_PINSTATE_PINSTATE1(value)         (EIC_PINSTATE_PINSTATE1_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE1_Pos)) /* Assigment of value for PINSTATE1 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE2_Pos            _UINT32_(2)                                          /* (EIC_PINSTATE) Pin State of EXTINT2 Position */
#define EIC_PINSTATE_PINSTATE2_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE2_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT2 Mask */
#define EIC_PINSTATE_PINSTATE2(value)         (EIC_PINSTATE_PINSTATE2_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE2_Pos)) /* Assigment of value for PINSTATE2 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE3_Pos            _UINT32_(3)                                          /* (EIC_PINSTATE) Pin State of EXTINT3 Position */
#define EIC_PINSTATE_PINSTATE3_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE3_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT3 Mask */
#define EIC_PINSTATE_PINSTATE3(value)         (EIC_PINSTATE_PINSTATE3_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE3_Pos)) /* Assigment of value for PINSTATE3 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE4_Pos            _UINT32_(4)                                          /* (EIC_PINSTATE) Pin State of EXTINT4 Position */
#define EIC_PINSTATE_PINSTATE4_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE4_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT4 Mask */
#define EIC_PINSTATE_PINSTATE4(value)         (EIC_PINSTATE_PINSTATE4_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE4_Pos)) /* Assigment of value for PINSTATE4 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE5_Pos            _UINT32_(5)                                          /* (EIC_PINSTATE) Pin State of EXTINT5 Position */
#define EIC_PINSTATE_PINSTATE5_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE5_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT5 Mask */
#define EIC_PINSTATE_PINSTATE5(value)         (EIC_PINSTATE_PINSTATE5_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE5_Pos)) /* Assigment of value for PINSTATE5 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE6_Pos            _UINT32_(6)                                          /* (EIC_PINSTATE) Pin State of EXTINT6 Position */
#define EIC_PINSTATE_PINSTATE6_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE6_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT6 Mask */
#define EIC_PINSTATE_PINSTATE6(value)         (EIC_PINSTATE_PINSTATE6_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE6_Pos)) /* Assigment of value for PINSTATE6 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE7_Pos            _UINT32_(7)                                          /* (EIC_PINSTATE) Pin State of EXTINT7 Position */
#define EIC_PINSTATE_PINSTATE7_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE7_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT7 Mask */
#define EIC_PINSTATE_PINSTATE7(value)         (EIC_PINSTATE_PINSTATE7_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE7_Pos)) /* Assigment of value for PINSTATE7 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE8_Pos            _UINT32_(8)                                          /* (EIC_PINSTATE) Pin State of EXTINT8 Position */
#define EIC_PINSTATE_PINSTATE8_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE8_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT8 Mask */
#define EIC_PINSTATE_PINSTATE8(value)         (EIC_PINSTATE_PINSTATE8_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE8_Pos)) /* Assigment of value for PINSTATE8 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE9_Pos            _UINT32_(9)                                          /* (EIC_PINSTATE) Pin State of EXTINT9 Position */
#define EIC_PINSTATE_PINSTATE9_Msk            (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE9_Pos)        /* (EIC_PINSTATE) Pin State of EXTINT9 Mask */
#define EIC_PINSTATE_PINSTATE9(value)         (EIC_PINSTATE_PINSTATE9_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE9_Pos)) /* Assigment of value for PINSTATE9 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE10_Pos           _UINT32_(10)                                         /* (EIC_PINSTATE) Pin State of EXTINT10 Position */
#define EIC_PINSTATE_PINSTATE10_Msk           (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE10_Pos)       /* (EIC_PINSTATE) Pin State of EXTINT10 Mask */
#define EIC_PINSTATE_PINSTATE10(value)        (EIC_PINSTATE_PINSTATE10_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE10_Pos)) /* Assigment of value for PINSTATE10 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE11_Pos           _UINT32_(11)                                         /* (EIC_PINSTATE) Pin State of EXTINT11 Position */
#define EIC_PINSTATE_PINSTATE11_Msk           (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE11_Pos)       /* (EIC_PINSTATE) Pin State of EXTINT11 Mask */
#define EIC_PINSTATE_PINSTATE11(value)        (EIC_PINSTATE_PINSTATE11_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE11_Pos)) /* Assigment of value for PINSTATE11 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE12_Pos           _UINT32_(12)                                         /* (EIC_PINSTATE) Pin State of EXTINT12 Position */
#define EIC_PINSTATE_PINSTATE12_Msk           (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE12_Pos)       /* (EIC_PINSTATE) Pin State of EXTINT12 Mask */
#define EIC_PINSTATE_PINSTATE12(value)        (EIC_PINSTATE_PINSTATE12_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE12_Pos)) /* Assigment of value for PINSTATE12 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE13_Pos           _UINT32_(13)                                         /* (EIC_PINSTATE) Pin State of EXTINT13 Position */
#define EIC_PINSTATE_PINSTATE13_Msk           (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE13_Pos)       /* (EIC_PINSTATE) Pin State of EXTINT13 Mask */
#define EIC_PINSTATE_PINSTATE13(value)        (EIC_PINSTATE_PINSTATE13_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE13_Pos)) /* Assigment of value for PINSTATE13 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE14_Pos           _UINT32_(14)                                         /* (EIC_PINSTATE) Pin State of EXTINT14 Position */
#define EIC_PINSTATE_PINSTATE14_Msk           (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE14_Pos)       /* (EIC_PINSTATE) Pin State of EXTINT14 Mask */
#define EIC_PINSTATE_PINSTATE14(value)        (EIC_PINSTATE_PINSTATE14_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE14_Pos)) /* Assigment of value for PINSTATE14 in the EIC_PINSTATE register */
#define EIC_PINSTATE_PINSTATE15_Pos           _UINT32_(15)                                         /* (EIC_PINSTATE) Pin State of EXTINT15 Position */
#define EIC_PINSTATE_PINSTATE15_Msk           (_UINT32_(0x1) << EIC_PINSTATE_PINSTATE15_Pos)       /* (EIC_PINSTATE) Pin State of EXTINT15 Mask */
#define EIC_PINSTATE_PINSTATE15(value)        (EIC_PINSTATE_PINSTATE15_Msk & (_UINT32_(value) << EIC_PINSTATE_PINSTATE15_Pos)) /* Assigment of value for PINSTATE15 in the EIC_PINSTATE register */
#define EIC_PINSTATE_Msk                      _UINT32_(0x0000FFFF)                                 /* (EIC_PINSTATE) Register Mask  */

